Repository: jgomes-03/plugin-pretix-eupago
Catalog: eupago/locale/*/LC_MESSAGES/django.po
Languages: pt

source: Accept payments via EuPago (Credit Card, MBWay, Multibanco, PayShop)
pt: Aceite pagamentos via EuPago (Cartão de Crédito, MBWay, Multibanco, PayShop)

source: API Key
pt: Chave API

source: Your EuPago API key
pt: A sua chave API da EuPago

source: Client ID
pt: ID do Cliente

source: Your EuPago Client ID
pt: O seu ID de Cliente do EuPago

source: Client Secret
pt: Segredo do Cliente

source: Your EuPago Client Secret
pt: O seu Segredo de Cliente do EuPago

source: Webhook Secret
pt: Segredo do Webhook

source: Secret key for webhook validation
pt: Chave secreta para validação de webhook

source: Environment
pt: Ambiente

source: Sandbox (Testing)
pt: Sandbox (Testes)

source: Live (Production)
pt: Produção

source: Use sandbox for testing, live for production
pt: Use sandbox para testes, produção para ambiente real

source: Credit Card (EuPago v2)
pt: Cartão de Crédito (EuPago v2)

source: Mobile phone number
pt: Número de telemóvel

source: Enter your mobile phone number for MBWay payment
pt: Introduza o seu número de telemóvel para pagamento MBWay

source: Payment description
pt: Descrição do pagamento

source: This will be displayed to customers during checkout
pt: Isto será mostrado aos clientes durante o checkout

source: Pay securely with your credit card
pt: Pague de forma segura com o seu cartão de crédito

source: Pay with MBWay using your mobile phone
pt: Pague com MBWay usando o seu telemóvel

source: Pay via bank transfer using Multibanco reference
pt: Pague por transferência bancária usando referência Multibanco

source: Pay in cash at any PayShop location
pt: Pague em dinheiro em qualquer loja PayShop

source: Security Features
pt: Características de Segurança

source: 256-bit SSL encryption
pt: Encriptação SSL de 256 bits

source: Secure payment processing
pt: Processamento de pagamento seguro

source: PCI DSS compliant
pt: Conforme com PCI DSS

source: Accepted Payment Methods
pt: Métodos de Pagamento Aceites

source: Credit Card Legacy(EuPago)
pt: Cartão de Crédito (EuPago - Legacy)

source: MB and Credit Card (EuPago)
pt: MB e Cartão de Crédito (EuPago)

source: MBWay Legacy(EuPago)
pt: MBWay (EuPago - Legacy)

source: Multibanco Legacy (EuPago)
pt: Multibanco (EuPago - Legacy)

source: PayShop Legacy (EuPago)
pt: PayShop (EuPago - Legacy)

source: Authentication failed. Please check your EuPago API key configuration.
pt: Autenticação falhou. Por favor verifique a configuração da sua chave API da EuPago.

source: Access denied. Please verify your EuPago API permissions.
pt: Acesso negado. Por favor verifique as permissões da sua API da EuPago.

source: Payment provider communication failed. Please try again later.
pt: Falha na comunicação com o fornecedor de pagamento. Por favor tente novamente mais tarde.

source: Credit card payments are limited to €3999. Please use a different payment method.
pt: Pagamentos com cartão de crédito estão limitados a €3999. Por favor use um método de pagamento diferente.

source: Payment initialization failed: {}
pt: Falha na inicialização do pagamento: {}

source: Payment failed. Please try again later.
pt: Pagamento falhou. Por favor tente novamente mais tarde.

source: MB/Credit Card authentication failed. Please check your MB/CC API key configuration.
pt: Autenticação MB/Cartão de Crédito falhou. Por favor verifique a configuração da sua chave API MB/CC.

source: MB/Credit Card access denied. Please verify your MB/CC API permissions.
pt: Acesso MB/Cartão de Crédito negado. Por favor verifique as permissões da sua API MB/CC.

source: MB/Credit Card payment provider communication failed. Please try again later.
pt: Falha na comunicação com o fornecedor de pagamento MB/Cartão de Crédito. Por favor tente novamente mais tarde.

source: MB/CC payment initialization failed: {}
pt: Falha na inicialização do pagamento MB/CC: {}

source: MB/CC payment failed. Please try again later.
pt: Pagamento MB/CC falhou. Por favor tente novamente mais tarde.

source: MBWay payment provider communication failed. Please try again later.
pt: Falha na comunicação com o fornecedor de pagamento MBWay. Por favor tente novamente mais tarde.

source: Phone number is required for MBWay payments
pt: Número de telemóvel é obrigatório para pagamentos MBWay

source: MBWay payment initialization failed
pt: Falha na inicialização do pagamento MBWay

source: MBWay payment failed. Please try again.
pt: Pagamento MBWay falhou. Por favor tente novamente.

source: Cardholder name
pt: Nome do titular do cartão

source: Name as it appears on the card (optional - can be filled on EuPago page)
pt: Nome como aparece no cartão (opcional - pode ser preenchido na página da EuPago)

source: Pay with MB or Credit Card
pt: Pagar com MB ou Cartão de Crédito

source: MB and Credit Card
pt: MB e Cartão de Crédito
